        function getMultiLine(f) {
            var lines =f.toString(); 
            return lines.substring(lines.indexOf("/*") + 3, lines.lastIndexOf("*/"));   
        }
        //字符画不能随意缩进，不然显示会错位
        var console_text = function() {  
/* 

 ███▄ ▄███▓ ▒█████   ▒█████   ███▄    █   ██████  ██░ ██  ▒█████  ▄▄▄█████▓
▓██▒▀█▀ ██▒▒██▒  ██▒▒██▒  ██▒ ██ ▀█   █ ▒██    ▒ ▓██░ ██▒▒██▒  ██▒▓  ██▒ ▓▒
▓██    ▓██░▒██░  ██▒▒██░  ██▒▓██  ▀█ ██▒░ ▓██▄   ▒██▀▀██░▒██░  ██▒▒ ▓██░ ▒░
▒██    ▒██ ▒██   ██░▒██   ██░▓██▒  ▐▌██▒  ▒   ██▒░▓█ ░██ ▒██   ██░░ ▓██▓ ░ 
▒██▒   ░██▒░ ████▓▒░░ ████▓▒░▒██░   ▓██░▒██████▒▒░▓█▒░██▓░ ████▓▒░  ▒██▒ ░ 
░ ▒░   ░  ░░ ▒░▒░▒░ ░ ▒░▒░▒░ ░ ▒░   ▒ ▒ ▒ ▒▓▒ ▒ ░ ▒ ░░▒░▒░ ▒░▒░▒░   ▒ ░░   
░  ░      ░  ░ ▒ ▒░   ░ ▒ ▒░ ░ ░░   ░ ▒░░ ░▒  ░ ░ ▒ ░▒░ ░  ░ ▒ ▒░     ░    
░      ░   ░ ░ ░ ▒  ░ ░ ░ ▒     ░   ░ ░ ░  ░  ░   ░  ░░ ░░ ░ ░ ▒    ░      
       ░       ░ ░      ░ ░           ░       ░   ░  ░  ░    ░ ░           
                                                                           


      %c ♥ 我今天也喜欢你
               获得陪玩券，快来找我玩吧 ^O^
*/  
        }
        console.log(getMultiLine(console_text),'color:#FFCBD4;font-size:18px')